{
  "version": "https://jsonfeed.org/version/1",
  "title": "Jonathan Irhodia&#39;s Personal Blog",
  "home_page_url": "/",
  "feed_url": "//feed/feed.json",
  "description": "I am writing about my experiences as a naval navel-gazer.",
  "author": {
    "name": "elcharitas",
    "url": "https://elcharitas.com.ng/p/about/"
  },
  "items": [{
      "id": "/archive/portfolio/",
      "url": "/archive/portfolio/",
      "title": "Portfolio",
      "content_html": "",
      "date_published": "2020-12-25T15:42:12+00:00"
    },{
      "id": "/archive/broadview/a-techy-christmas/",
      "url": "/archive/broadview/a-techy-christmas/",
      "title": "A Techy Christmas?",
      "content_html": "Can you recall the last time you sat with the family just to enjoy one another&#39;s company whilst being so open and rather care free in speech? Perhaps you were asked when it was you felt loved the most, which holiday would it be? Easter, Hannukkah or Christmas. Here is that one time in a year in which families become closer and men become more aware of the presence of Emmanuel. Compared to so many other days in the year, she(Christmas) welcomes all far and near asking them to simply recall and understand what love is. Christmas is great especially for tech enthusiats of which i am one. She gives us the reason to drop our notepads and stop staring at our screens and to feel human again as most times I&#39;ve found sanity to greatly reduce in over stressed developers. And so I wonder, how would the first christmas be like if the develpers who so much appeciate the holiday were around at the time and if technology was made widespread available then as it is now? I&#39;ve taken the time to list some of the possibilities 1. Record Accuracy or Instant Share: When discusing on the gospels, scholars argue on accuracy of the narrations. Matthew told us of the star of Bethlehem and of the Magis and of the killings of the newborns by Herod something which Luke made no mention of in his account. The Fix: With new social media platforms being launched almost every other day, some making it while others dieing off and with the popular ground breakers, Media Giants like Faceboo, Twitter, Instagram just to name a few. Joseph would have found it so easy to document everything and prolly even use instant sharing to get it across multiple platforms. 2. The Magis Journey: I personally like to think of my self as a star gazer just like the Magis of Jesus time. They started on a long journey from the east following a star. Scientifically, following a star is plain impossible since you&#39;d simply be going in a semi-cirle if you did. The Fix: Dropping the science fact, the Magis who are believed to have been a couple of months late in bearing their gifts to the messiah, would have gotten to bethlehem in a flash with beauties like Tesla motors or Ford cars but then again, if technology was that adavnced, Joseph and Mary would have just stayed in Nazareth, using an Iphone or an Android and would have enrolled in the census... 3. The Star of Bethlehem The complexities surrounding this star is far from over. Scholars like to ask: How can a Star direct this Magis but then again, we speak of the birth of God, anything is possible! The Fix: State of the Art Observatories, the self same kind we now use to watch for alien life forces, could be particularly useful to the Magis. In Conclusion: No matter which point, we choose to raise, it would seem there are just too many ways the king of Glory could have been revealed and far greater ways tech could have made the whole thing easier for all. The essence however is not to necessarily show what tech can do but to reveal what the absence of mordern technology meant in the situations outlined above. Stay safe and Thanks for reading....",
      "date_published": "2020-12-25T00:00:00+00:00"
    }
  ]
}
